pmo-dataset/variations/graphviz_with_ids/15.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Conduct\nself-assessment"];
  "Task_2" [label="Make necessary\ncorrections or\nimprovements"];
  "Task_3" [label="Issue official\ndocuments"];
  "Task_4" [label="Conduct external\naudit"];
  "Task_5" [label="Award certification"];
  "Task_6" [label="Schedule compliance\naudit"];
  "Task_7" [label="Identify gaps or\nissues"];
  "Task_8" [label="Prepare\ndocumentation"];
  "Task_9" [label="Gather evidence"];
  "Task_10" [label="Conduct final audit"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "Task_9" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Task_1";
  "Task_3" -> "ExclusiveGateway_2";
  "ParallelGateway_2" -> "Task_4";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
  "ExclusiveGateway_1" -> "Task_5";
  "Task_7" -> "Task_2";
  "Task_4" -> "Task_7";
  "Task_6" -> "ParallelGateway_1";
  "Task_8" -> "ParallelGateway_2";
  "Task_1" -> "ParallelGateway_2";
  "Task_5" -> "Task_3";
  "StartNoneEvent_1" -> "Task_6";
  "Task_2" -> "Task_10";
  "ParallelGateway_1" -> "Task_9";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "ParallelGateway_1" -> "Task_8";
  "Task_10" -> "ExclusiveGateway_1";
}
